Catalogs/Действия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Действия</Name>
			<Comment>ВыполняемыеДействия</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняемаяОбработкаДоОтправкиКоманд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняемаяОбработкаПослеОтправкиКоманд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаДоОтправкиКомандАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаПослеОтправкиКомандАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтправляемыеКоманды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аргумент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопАргументNET</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидатьЗавершенияКоманды</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ВыполненныеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ВыполненныеДействия</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Действия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Действия/Ext/ObjectModule.bsl
Функция ВыполнитьДействие() Экспорт
	
	Если ОбработкаДоОтправкиКомандАктивна = Истина 
		или ЗначениеЗаполнено(Оборудование)
		или ОбработкаПослеОтправкиКомандАктивна = Истина Тогда
			//Отметка о старте
			ДатаСтарта = ТекущаяДата();
			ЗаписьВРегистр = РегистрыСведений.ВыполненныеДействия.СоздатьМенеджерЗаписи();
			ЗаписьВРегистр.Период = ДатаСтарта;
			ЗаписьВРегистр.Действие = Ссылка;
			ЗаписьВРегистр.Записать(Истина);
	КонецЕсли;

	
	Если ОбработкаДоОтправкиКомандАктивна = Истина Тогда 
		Выполнить(ВыполняемаяОбработкаДоОтправкиКоманд);
	КонецЕсли;

		
	Ответы = Новый Структура();
	Если ЗначениеЗаполнено(Оборудование) Тогда 
		Для Каждого Команда Из ОтправляемыеКоманды Цикл
			Если Команда.ОжидатьЗавершенияКоманды Тогда
				Ответ = К.ВыполнитьКоманду(Оборудование, Команда.НомерПина, Команда.Команда, Команда.Аргумент, Команда.ДопАргументNET);
				Ответы.Вставить("Команда" + Команда.НомерСтроки,Ответ);
			Иначе
				МассивПараметровДляКоманды = Новый Массив();
				МассивПараметровДляКоманды.Добавить(Оборудование);
				МассивПараметровДляКоманды.Добавить(Команда.НомерПина);
				МассивПараметровДляКоманды.Добавить(Команда.Команда);
				МассивПараметровДляКоманды.Добавить(Команда.Аргумент);
				МассивПараметровДляКоманды.Добавить(Команда.ДопАргументNET);
				ОбщегоНазначения.ВыполнитьПроцедуруФункциюВФонеНаСервере("К.ВыполнитьКоманду", МассивПараметровДляКоманды); 
				Ответы.Вставить("Команда" + Команда.НомерСтроки,"Ожидание завершения команды выключено");				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбработкаПослеОтправкиКомандАктивна = Истина Тогда 
		Выполнить(ВыполняемаяОбработкаПослеОтправкиКоманд);
	КонецЕсли;

	
	Если ОбработкаДоОтправкиКомандАктивна = Истина 
		или ЗначениеЗаполнено(Оборудование)
		или ОбработкаПослеОтправкиКомандАктивна = Истина Тогда
			ЗаписьВРегистр.ДатаЗавершения = ТекущаяДата();
			ЗаписьВРегистр.Записать(Истина);
	КонецЕсли;
		

	Возврат Ответы;
	
КонецФункции
